app/views/school_classes/show.html.erb

SELECT  "school_classes".* FROM "school_classes"  ORDER BY "school_classes"."id" DESC LIMIT 1
---
<%= SchoolClass.last.title %>