app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" DEFAULT VALUES
---
  def create
    @school_class = SchoolClass.new
    @school_class.title = params[:title]
    @school_class.room_number = params[:school_number]
    @school_class.save

INSERT INTO "school_classes" DEFAULT VALUES
---
  def new
    @school_class = SchoolClass.new
    @school_class.title = params[:title]
    @school_class.room_number = params[:school_number]
    @school_class.save

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ? WHERE "school_classes"."id" = ?  [["title", nil], ["room_number", nil], ["id", 1]]
---
  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(title: params[:title], room_number: params[:room_number])